src/Catalogs/Оборудование/Оборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Оборудование</name>
  <attributes>
    <name>АгентКИП</name>
    <type>
      <types>CatalogRef.АгентыКИП</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Архитектура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновленияИнформацииОСистеме</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоНетДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВнешнегоАгента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МакАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПроцентДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперационнаяСистема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперационнаяСистемаВерсия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗаписи</name>
    <comment>Период записи данных в регистр сведений &quot;Текущие значения производительности&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗаписиПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаДляВосстановления</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаЭксплуатации</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьДоступность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьДампы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьДанныеПроизводительности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОС</name>
    <type>
      <types>EnumRef.ТипОС</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРоль</name>
    <type>
      <types>CatalogRef.РолиОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьСчетчикПоНаименованию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯзыкОС</name>
    <type>
      <types>EnumRef.ЯзыкиСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьДанныеЛицензий1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияRing</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаUTCОбновленияЛицензий1С</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетчикиПроизводительности</name>
    <attributes>
      <name>СобиратьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетчикПроизводительности</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
    <attributes>
      <name>Зафиксировать</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВнешниеЦКК</name>
    <attributes>
      <name>ПередаватьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийЦКК</name>
      <type>
        <types>CatalogRef.ВнешниеЦКК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиОборудования</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиОборудования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетчикиПроизводительностиРолей</name>
    <attributes>
      <name>СчетчикПроизводительности</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиОборудования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Оборудование/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ИзменитьНесколько(Команда)
    
    ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменитьЭлементыЗакрытие", ЭтотОбъект);
    ПараметрыОткрытия = Неопределено;
    
    Если ЭтотОбъект.Элементы.Список.ТекущиеДанные <> Неопределено Тогда
        ПараметрыОткрытия = Новый Структура("СобиратьДанныеПроизводительности, ПериодЗаписи, ПроверятьДоступность, Таймаут, ПериодКонтроля, МинимальныйПроцентДоступности, ДопустимоНетДанных, ИспользоватьВнешнегоАгента, РегистрироватьДампы");
        ТекДанные = ЭтотОбъект.Элементы.Список.ТекущиеДанные;
        ПараметрыОткрытия.СобиратьДанныеПроизводительности = ТекДанные.СобиратьДанныеПроизводительности;
        ПараметрыОткрытия.ПериодЗаписи = ТекДанные.ПериодЗаписи;
        ПараметрыОткрытия.ПроверятьДоступность = ТекДанные.ПроверятьДоступность;
        ПараметрыОткрытия.Таймаут = ТекДанные.Таймаут;
        ПараметрыОткрытия.ПериодКонтроля = ТекДанные.ПериодКонтроля;
        ПараметрыОткрытия.МинимальныйПроцентДоступности = ТекДанные.МинимальныйПроцентДоступности;
        ПараметрыОткрытия.ДопустимоНетДанных = ТекДанные.ДопустимоНетДанных;
        ПараметрыОткрытия.ИспользоватьВнешнегоАгента = ТекДанные.ИспользоватьВнешнегоАгента;
        ПараметрыОткрытия.РегистрироватьДампы = ТекДанные.РегистрироватьДампы;
    КонецЕсли;
    
    ОткрытьФорму("Справочник.Оборудование.Форма.ФормаИзменитьЭлементыСписка", ПараметрыОткрытия, ЭтотОбъект,,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЭлементыЗакрытие(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
    
    Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") И РезультатЗакрытия.Количество() > 0  Тогда
        ИзменитьЭлементыЗакрытиеНаСервере(ЭтотОбъект.Элементы.Список.ВыделенныеСтроки, РезультатЗакрытия);
        ЭтотОбъект.Элементы.Список.Обновить();
    КонецЕсли;
        
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьЭлементыЗакрытиеНаСервере(Знач ВыделенныеСтроки, РезультатЗакрытия)
    
    Для Каждого ТекЭлемент Из ВыделенныеСтроки Цикл
        
        СпрОбъект = ТекЭлемент.ПолучитьОбъект();
        
        Для Каждого ТекРезультат Из РезультатЗакрытия Цикл
            
            СпрОбъект[ТекРезультат.Ключ] = ТекРезультат.Значение;
            
            Если ТекРезультат.Ключ = "ПериодЗаписи" Тогда
                
                Если ТекРезультат.Значение = 0 Тогда
                    СпрОбъект.ПериодЗаписиПредставление = "Не записывать";
                ИначеЕсли ТекРезультат.Значение = 1 Тогда
                    СпрОбъект.ПериодЗаписиПредставление = "1 сек";
                ИначеЕсли ТекРезультат.Значение = 5 Тогда
                    СпрОбъект.ПериодЗаписиПредставление = "5 сек";
                ИначеЕсли ТекРезультат.Значение = 10 Тогда
                    СпрОбъект.ПериодЗаписиПредставление = "10 сек";
                ИначеЕсли ТекРезультат.Значение = 30 Тогда
                    СпрОбъект.ПериодЗаписиПредставление = "30 сек";
                ИначеЕсли ТекРезультат.Значение = 60 Тогда
                    СпрОбъект.ПериодЗаписиПредставление = "1 мин";
                КонецЕсли;    
            КонецЕсли;
            
        КонецЦикла;
        
        СпрОбъект.Записать();
                
    КонецЦикла;
    
КонецПроцедуры
